// 霸都丶傲天 2019年10月10日 https://github.com/AJLoveChina/birthday
var config = {
    // 句子的长度可以任意， 你可以写十句话， 二十句话都可以
    // 每句话尽量不要超过15个字,不然展示效果可能不太好
    texts: [
        "时间来到了2022年7月24日早上12点30分",      //这里,每句话结尾的最后一个逗号必须是英文的哦!! 很重要哦!!
        "今天是My beloved friend赵玮芊的第21个生日",  // 同上...
        "此刻万千词语浮现脑海但是很难选出最好的几个来祝福",
        "这是一个不需要说什么但是需要仪式感的节日",
        "٩(๛ ˘ ³˘)۶ 我是这么觉得的",
        "不想再谈论满是遗憾懵懂的过去",
        "也不想交流变幻莫测的未来会是什么样",
        "还有焦虑踌躇的现在要怎么做",
        "all i wanna say is taking good care of yourself",
        "最重要是身体健康、幸福快乐٩(๛ ˘ ³˘)۶",
        "小宝要记得安好",
        "多吃点，努力让自己穿的下M码的裙子",
        "希望你听着这首歌就像吃了药一样身心治愈",
        '然后"当一个幸福的傻更更的你"',
        "未来一定要一起开蛋糕店啊！",
        "─=≡Σ((( つ•̀ 3 •́)つ小宝 Happy Birthday!!!",
    ],
    /**
     * imgs 可以不填, 但是如果要填写的话必须遵循下面的格式
     * "对应上面的文字, 要完全一样" : "图片地址, 可以把图片放在imgs文件夹中"
     * 例如
     * "心爱的小可爱": "./imgs/xiaokeai.jpg"
     *
     * 如果不要图片的话, 直接在每行开头写两个斜杠注释即可, 例如下面的 "今天是你的生日" 的图片就不会展示了:)
     * Tip: 图片最好用正方形or接近正方形, 看起来效果更好
     */
    imgs: {
        "时间来到了2022年7月24日早上3点43分": "./imgs/time.png",
        "今天是My beloved friend赵玮芊的第21个生日": "./imgs/21.jpg",
        "此刻万千词语浮现脑海但是很难选出最好的几个来祝福": "./imgs/think.jpg",
        "这是一个不需要说什么但是需要仪式感的节日": "./imgs/noneed.jpg",
        "٩(๛ ˘ ³˘)۶ 我是这么觉得的": "./imgs/haha.png",
        "不想再谈论满是遗憾懵懂的过去": "./imgs/past.jpg",
        "也不想交流变幻莫测的未来会是什么样": "./imgs/future.jpg",
        "还有焦虑踌躇的现在要怎么做": "./imgs/now.jpg",
        "all i wanna say is taking good care of yourself": "./imgs/care.jpg",
        "最重要是身体健康、幸福快乐٩(๛ ˘ ³˘)۶": "./imgs/happy.jpg",
        "小宝要记得安好": "./imgs/chuo.gif",
        "多吃点，努力让自己穿的下M码的裙子": "./imgs/eat.png",
        "希望你听着这首歌就像吃了药一样身心治愈": "./imgs/medcine.png",
        '然后"当一个幸福的傻更更的你"': "./imgs/stupid.jpg",
        "未来一定要一起开蛋糕店啊！": "./imgs/cake.png",
        "─=≡Σ((( つ•̀ 3 •́)つ小宝 Happy Birthday!!!": "./imgs/21.jpg"
    },
    
    // 按钮文字描述, 以下是默认的按钮文字，英文的，您可以改成你喜欢的文字
    desc: {
        turn_on: " ─=≡Σ((( つ•̀ 3 •́)つ 点击开始",
        play: "灯光到位╭☞( ￣ ▽￣)╭☞ 音乐起  ",
        bannar_coming: "٩(●´৺`●)૭ 上横幅 ٩(●´৺`●)و",
        balloons_flying: "d(ŐдŐ๑) 好像还少点东西 (๑ŐдŐ)b",
        cake_fadein: "(´▽｀)ノ♪电子蛋糕应该还没吃过吧",
        light_candle: "人生仅有一次的twenty-one ٩(๛ ˘ ³˘)۶ 舒服地许愿吧",
        wish_message: "*\(^o^)/*生日快乐～梦想成真*\(^o^)/*",
        story: "超盐凉(๑•̀ㅂ•́)ﾉ➹♡给未来合伙人小宝的留言"
    },

    // 结束语
    loveText: 'From someone lovely aka. Mrs.Jeon',

};
